app/controllers/accounts_controller.rb

  def create
    @account = Account.new(params_account)

    if @account.save
---
INSERT INTO "accounts" ("email", "password_digest", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)