app/controllers/travels_controller.rb

SELECT  "travels".* FROM "travels" WHERE "travels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @travel = Travel.find(params[:id])

INSERT INTO "travels" ("user_id", "city_name", "description", "created_at", "updated_at", "travel_date") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["city_name", "London"], ["description", "test"], ["created_at", "2018-08-04 17:52:22.516555"], ["updated_at", "2018-08-04 17:52:22.516555"], ["travel_date", "2018-08-21"]]
---
  def create
    @travel = current_user.travels.build(params_travel)

    if @travel.save

SELECT  "travels".* FROM "travels" WHERE "travels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @travel = Travel.find(params[:id])

SELECT  "travels".* FROM "travels" WHERE "travels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "travels" SET "description" = ?, "updated_at" = ? WHERE "travels"."id" = ?  [["description", ""], ["updated_at", "2018-08-03 18:54:07.802978"], ["id", 1]]
---
  def update
    @travel = Travel.find(params[:id])

    if @travel.update(params_travel)

SELECT  "travels".* FROM "travels" WHERE "travels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "travels" WHERE "travels"."id" = ?  [["id", 1]]
---
  def destroy
    @travel = Travel.find(params[:id])
    @travel.delete